In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [13]:
df = pd.read_csv("Resources/GlobalLandTemperaturesByCity.csv")
df.head(100)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
...,...,...,...,...,...,...,...
95,1751-10-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
96,1751-11-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
97,1751-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
98,1752-01-01,-0.781,2.622,Århus,Denmark,57.05N,10.33E
99,1752-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [4]:
df.shape

(8599212, 7)

In [17]:
df.dtypes

dt                                object
AverageTemperature               float64
AverageTemperatureUncertainty    float64
City                              object
Country                           object
Latitude                          object
Longitude                         object
dtype: object

In [6]:
#List of state names
city_names = df.City.unique()
city_names

array(['Århus', 'Çorlu', 'Çorum', ..., 'Zurich', 'Zuwarah', 'Zwolle'],
      dtype=object)

In [7]:
# list of country names
country_names = df.Country.unique()
country_names

array(['Denmark', 'Turkey', 'Kazakhstan', 'China', 'Spain', 'Germany',
       'Nigeria', 'Iran', 'Russia', 'Canada', "Côte D'Ivoire",
       'United Kingdom', 'Saudi Arabia', 'Japan', 'United States',
       'India', 'Benin', 'United Arab Emirates', 'Mexico', 'Venezuela',
       'Ghana', 'Ethiopia', 'Australia', 'Yemen', 'Indonesia', 'Morocco',
       'Pakistan', 'France', 'Libya', 'Burma', 'Brazil', 'South Africa',
       'Syria', 'Egypt', 'Algeria', 'Netherlands', 'Malaysia', 'Portugal',
       'Ecuador', 'Italy', 'Uzbekistan', 'Philippines', 'Madagascar',
       'Chile', 'Belgium', 'El Salvador', 'Romania', 'Peru', 'Colombia',
       'Tanzania', 'Tunisia', 'Turkmenistan', 'Israel', 'Eritrea',
       'Paraguay', 'Greece', 'New Zealand', 'Vietnam', 'Cameroon', 'Iraq',
       'Afghanistan', 'Argentina', 'Azerbaijan', 'Moldova', 'Mali',
       'Congo (Democratic Republic Of The)', 'Thailand',
       'Central African Republic', 'Bosnia And Herzegovina', 'Bangladesh',
       'Switzerland', 'Equatorial Guinea', 'Cuba', 'Lebanon',
       'Mozambique', 'Serbia', 'Angola', 'Somalia', 'Norway', 'Nepal',
       'Poland', 'Ukraine', 'Guinea Bissau', 'Malawi', 'Burkina Faso',
       'Slovakia', 'Congo', 'Belarus', 'Gambia', 'Czech Republic',
       'Hungary', 'Burundi', 'Zimbabwe', 'Bulgaria', 'Haiti',
       'Puerto Rico', 'Sri Lanka', 'Nicaragua', 'Zambia', 'Honduras',
       'Taiwan', 'Bolivia', 'Guinea', 'Ireland', 'Senegal', 'Latvia',
       'Qatar', 'Albania', 'Tajikistan', 'Kenya', 'Guatemala', 'Finland',
       'Sierra Leone', 'Sweden', 'Botswana', 'Guyana', 'Austria',
       'Uganda', 'Armenia', 'Dominican Republic', 'Jordan', 'Djibouti',
       'Sudan', 'Lithuania', 'Rwanda', 'Jamaica', 'Togo', 'Macedonia',
       'Cyprus', 'Gabon', 'Slovenia', 'Bahrain', 'Swaziland', 'Niger',
       'Lesotho', 'Liberia', 'Uruguay', 'Chad', 'Bahamas', 'Mauritania',
       'Panama', 'Suriname', 'Cambodia', 'Montenegro', 'Mauritius',
       'Papua New Guinea', 'Iceland', 'Croatia', 'Reunion', 'Oman',
       'Costa Rica', 'South Korea', 'Hong Kong', 'Singapore', 'Estonia',
       'Georgia', 'Mongolia', 'Laos', 'Namibia'], dtype=object)

In [8]:
df.AverageTemperature.isna().value_counts()

False    8235082
True      364130
Name: AverageTemperature, dtype: int64

In [9]:
#Percentage of null values
364130/8235082

0.04421692461592975

Change dt column to a date time object

In [18]:
df_clean.dt = pd.to_datetime(df_clean.dt)

In [21]:
df_clean.dtypes

dt                               datetime64[ns]
AverageTemperature                      float64
AverageTemperatureUncertainty           float64
City                                     object
Country                                  object
Latitude                                 object
Longitude                                object
dtype: object

In [28]:
df2 = df_clean[df_clean["dt"] >= "1921"]

# Removing null cells from Average Temperature

In [29]:
df2.AverageTemperature.isna().value_counts()

False    3903560
True        3070
Name: AverageTemperature, dtype: int64

In [30]:
3070/3903560

0.000786461588908586

In [31]:
df2.AverageTemperature = df2.AverageTemperature.fillna(method='bfill')

C:\Users\trevo\anaconda3\envs\myprojects\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [32]:
df2.AverageTemperature.isna().value_counts()

False    3906629
True           1
Name: AverageTemperature, dtype: int64

In [33]:
df2.AverageTemperature = df2.AverageTemperature.fillna(method='ffill')

C:\Users\trevo\anaconda3\envs\myprojects\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [34]:
df2.AverageTemperature.isna().value_counts()

False    3906630
Name: AverageTemperature, dtype: int64

# Convert Average Temperature celsius to fahrenheit

In [35]:
df2

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
2126,1921-01-01,2.409,0.430,Århus,Denmark,57.05N,10.33E
2127,1921-02-01,1.995,0.437,Århus,Denmark,57.05N,10.33E
2128,1921-03-01,5.295,0.332,Århus,Denmark,57.05N,10.33E
2129,1921-04-01,8.332,0.456,Århus,Denmark,57.05N,10.33E
2130,1921-05-01,12.552,0.423,Århus,Denmark,57.05N,10.33E
...,...,...,...,...,...,...,...
8599207,2013-05-01,11.464,0.236,Zwolle,Netherlands,52.24N,5.26E
8599208,2013-06-01,15.043,0.261,Zwolle,Netherlands,52.24N,5.26E
8599209,2013-07-01,18.775,0.193,Zwolle,Netherlands,52.24N,5.26E
8599210,2013-08-01,18.025,0.298,Zwolle,Netherlands,52.24N,5.26E
8599211,2013-09-01,18.025,NaN,Zwolle,Netherlands,52.24N,5.26E

In [37]:
df2.AverageTemperature = df2["AverageTemperature"] *(9/5) + 32

C:\Users\trevo\anaconda3\envs\myprojects\lib\site-packages\pandas\core\generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [43]:
df2 = df2.rename(columns={'AverageTemperature': 'AverageTemperature(F)'})
df2

,dt,AverageTemperature(F),AverageTemperatureUncertainty,City,Country,Latitude,Longitude
2126,1921-01-01,36.3362,0.430,Århus,Denmark,57.05N,10.33E
2127,1921-02-01,35.5910,0.437,Århus,Denmark,57.05N,10.33E
2128,1921-03-01,41.5310,0.332,Århus,Denmark,57.05N,10.33E
2129,1921-04-01,46.9976,0.456,Århus,Denmark,57.05N,10.33E
2130,1921-05-01,54.5936,0.423,Århus,Denmark,57.05N,10.33E
...,...,...,...,...,...,...,...
8599207,2013-05-01,52.6352,0.236,Zwolle,Netherlands,52.24N,5.26E
8599208,2013-06-01,59.0774,0.261,Zwolle,Netherlands,52.24N,5.26E
8599209,2013-07-01,65.7950,0.193,Zwolle,Netherlands,52.24N,5.26E
8599210,2013-08-01,64.4450,0.298,Zwolle,Netherlands,52.24N,5.26E
8599211,2013-09-01,64.4450,NaN,Zwolle,Netherlands,52.24N,5.26E

In [44]:
df2.to_csv('CleanedGlobalLandTemperaturesByCity.csv')